In [1]:
import pandas as pd
companies = {
    'value' : [220, 160, 140, 117, 94],
    'Change': [17.5, 11.9, -8.5, -2.1, 3.5],
    'Sector' : ['Retail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsumg'])
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsumg       94     3.5    Tech

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsumg
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsumg'], dtype='object')

In [5]:
data.columns

Index(['value', 'Change', 'Sector'], dtype='object')

In [6]:

data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsumg'], dtype='object')

In [8]:
data.describe()

            value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [10]:
data.loc[data['value'] > 150]

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech

In [11]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsumg       3.5
Name: Change, dtype: float64

In [12]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsumg       94     3.5    Tech

In [13]:
data.iloc[3]

value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [14]:
data[0:3]

        value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [15]:
data['Amazon':'Microsoft']

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech

In [16]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsumg       94     3.5    Tech

In [21]:
data['value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsumg      188
Name: value, dtype: int64

In [22]:
data['value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsumg       92
Name: value, dtype: int64

In [23]:
data['value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsumg       96
Name: value, dtype: int64

In [30]:
div, rem = divmod(data['value'], 2)
div, rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsumg       47
 Name: value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsumg      0
 Name: value, dtype: int64)

In [31]:
data

           value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsumg       94     3.5    Tech

In [32]:
data.mean()

value     146.20
Change      4.46
dtype: float64

In [33]:
data.sum()

value                        731
Change                      22.3
Sector    RetailTechTechTechTech
dtype: object

In [36]:
data.sum(0)

value                        731
Change                      22.3
Sector    RetailTechTechTechTech
dtype: object

In [35]:
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsumg       97.5
dtype: float64

In [37]:
data.std()

value     48.095738
Change    10.456003
dtype: float64

In [38]:
data.quantile(.5)

value     140.0
Change      3.5
Name: 0.5, dtype: float64

In [40]:
data.min()

value         94
Change      -8.5
Sector    Retail
dtype: object

In [41]:
data.cumsum()

           value  Change                  Sector
Amazon       220    17.5                  Retail
Google       380    29.4              RetailTech
Apple        520    20.9          RetailTechTech
Microsoft    637    18.8      RetailTechTechTech
Samsumg      731    22.3  RetailTechTechTechTech

In [43]:
data.count()

value     5
Change    5
Sector    5
dtype: int64